{"ts": 1763171134.9254653, "window_days": 7, "features": {"window_days": 7, "totals": {"total_time_sec": 581.012490272522, "typing_words": 23, "backspaces": 13, "keys_pressed": 170, "mouse_distance": 94848.19849491118, "app_switches": 0}, "by_app_top": [{"exe": "chrome.exe", "time_sec": 429.05062317848206}, {"exe": "pycharm64.exe", "time_sec": 116.39935994148254}, {"exe": "notepad.exe", "time_sec": 16.2195246219635}, {"exe": "olk.exe", "time_sec": 9.16192626953125}, {"exe": "explorer.exe", "time_sec": 5.106692552566528}, {"exe": "searchhost.exe", "time_sec": 4.056596994400024}, {"exe": "bdagent.exe", "time_sec": 0.5138864517211914}, {"exe": "", "time_sec": 0.5038802623748779}], "per_day": [{"date": "2025-11-14", "time": 440.7034206390381, "words": 13, "backspaces": 7, "keys": 83, "mouse": 15084.458634815128, "switches": 8, "wpm": 1.7698977667769584}, {"date": "2025-11-15", "time": 140.3090696334839, "words": 10, "backspaces": 6, "keys": 87, "mouse": 79763.73986009604, "switches": 46, "wpm": 4.276273811574143}]}, "stress": {"level": "high", "score": 90, "confidence": 0.8, "signals": ["Sustained high backspace-to-word ratio (average 36% across recorded time), indicating uncertainty or difficulty in articulating thoughts.", "Extreme app switching observed on one of the active days (46 switches in 2.3 minutes), suggesting high distraction, lack of focus, or task context switching fatigue.", "Very high mouse distance relative to words typed on one of the active days (79,763 units for only 10 words), indicative of aimless navigation, searching, or difficulty engaging with productive tasks.", "Significant day-to-day volatility in app switching and mouse activity, with a sharp increase in unfocused activity on the second recorded day.", "Overall extremely low total recorded engagement time (less than 10 minutes over a 7-day window, with only 2 days of activity), which could imply severe disengagement, burnout, or unlogged work."], "notes": "The data provided covers an extremely short total engagement time across the 7-day window. While the overall duration is minimal, the patterns observed during the active periods are highly indicative of elevated stress. Specifically, the metrics for '2025-11-15' show severe signs of struggle, including intense distraction and minimal productive output within the recorded 2.3 minutes of activity. The low total activity for the week could itself be a symptom of high stress leading to disengagement, or it suggests significant periods of absence or unlogged work."}}
{"ts": 1763171163.1572196, "window_days": 7, "features": {"window_days": 7, "totals": {"total_time_sec": 581.012490272522, "typing_words": 23, "backspaces": 13, "keys_pressed": 170, "mouse_distance": 94848.19849491118, "app_switches": 0}, "by_app_top": [{"exe": "chrome.exe", "time_sec": 429.05062317848206}, {"exe": "pycharm64.exe", "time_sec": 116.39935994148254}, {"exe": "notepad.exe", "time_sec": 16.2195246219635}, {"exe": "olk.exe", "time_sec": 9.16192626953125}, {"exe": "explorer.exe", "time_sec": 5.106692552566528}, {"exe": "searchhost.exe", "time_sec": 4.056596994400024}, {"exe": "bdagent.exe", "time_sec": 0.5138864517211914}, {"exe": "", "time_sec": 0.5038802623748779}], "per_day": [{"date": "2025-11-14", "time": 440.7034206390381, "words": 13, "backspaces": 7, "keys": 83, "mouse": 15084.458634815128, "switches": 8, "wpm": 1.7698977667769584}, {"date": "2025-11-15", "time": 140.3090696334839, "words": 10, "backspaces": 6, "keys": 87, "mouse": 79763.73986009604, "switches": 46, "wpm": 4.276273811574143}]}, "stress": {"level": "high", "score": 85, "confidence": 0.6, "signals": ["Consistently high backspace-to-word ratio (average 0.56), indicating indecision, frustration, or difficulty articulating thoughts.", "Extremely high app switching on Day 2 (46 switches in ~2.3 minutes, approximately 20 switches/minute), a strong indicator of severe distraction, context-switching overload, or inability to focus.", "Disproportionately high mouse distance relative to words typed, particularly on Day 2 (79763 mouse distance for 10 words), suggesting aimless navigation, information seeking without productive output, or difficulty engaging in deep work.", "Significant day-to-day volatility in engagement metrics (app switches increasing dramatically, mouse distance increasing dramatically, total time decreasing) between the two observed days."], "notes": "The analysis is based on an extremely limited window of observed activity (less than 10 minutes across two reported days). While the patterns *within* this brief period strongly suggest an elevated stress level characterized by high distraction, indecision, and potential overwhelm, these findings may not be representative of the employee's overall well-being throughout an entire work week. Further data over longer, more typical work periods would be required for a more robust and generalized assessment. The discrepancy between 'totals.app_switches': 0 and 'per_day' app switches suggests either incomplete 'totals' data or a reporting error, with 'per_day' data prioritized for signal analysis due to its granularity."}}
{"ts": 1763173557.2504427, "window_days": 7, "features": {"window_days": 7, "totals": {"total_time_sec": 606.0416259765625, "typing_words": 23, "backspaces": 20, "keys_pressed": 190, "mouse_distance": 109311.89257587297, "app_switches": 0}, "by_app_top": [{"exe": "chrome.exe", "time_sec": 434.6543126106262}, {"exe": "pycharm64.exe", "time_sec": 134.29789638519287}, {"exe": "notepad.exe", "time_sec": 16.2195246219635}, {"exe": "olk.exe", "time_sec": 9.16192626953125}, {"exe": "explorer.exe", "time_sec": 5.106692552566528}, {"exe": "searchhost.exe", "time_sec": 4.056596994400024}, {"exe": "windsurf.exe", "time_sec": 1.5269098281860352}, {"exe": "bdagent.exe", "time_sec": 0.5138864517211914}, {"exe": "", "time_sec": 0.5038802623748779}], "per_day": [{"date": "2025-11-14", "time": 440.7034206390381, "words": 13, "backspaces": 7, "keys": 83, "mouse": 15084.458634815128, "switches": 8, "wpm": 1.7698977667769584}, {"date": "2025-11-15", "time": 165.3382053375244, "words": 10, "backspaces": 13, "keys": 107, "mouse": 94227.43394105784, "switches": 52, "wpm": 3.628925321737641}]}, "stress": {"level": "high", "score": 92, "confidence": 0.9, "signals": ["Extremely high backspace rate: The overall backspace-to-typed-words ratio is 20 backspaces for 23 words (approximately 46.5% of input deleted), reaching 56.5% on Day 2. This indicates significant struggle, indecision, or frustration during typing.", "Excessive app switching: On Day 2, 52 app switches were recorded in just 2.7 minutes (approximately 19.3 switches per minute). This is an extremely high rate, strongly suggesting severe context switching, distraction, or frantic task-hopping.", "High mouse distance with low words typed: The employee averaged approximately 4752.7 mouse units per word typed across the two days, peaking at 9422.7 units per word on Day 2. This indicates extensive unfocused navigation, browsing, or searching with very low productive textual output.", "Significant day-to-day volatility in unfocused metrics: App switches increased over 6-fold (from 8 to 52) and mouse distance increased over 6-fold (from ~15k to ~94k) from Day 1 to Day 2, while total active time significantly decreased. This suggests worsening focus and increasing fragmentation.", "Very short total active time: Only approximately 10 minutes of recorded active time across two days. If this represents the total work activity, it could indicate severe disengagement, an inability to focus for sustained periods (potentially stress-induced), or feeling overwhelmed."], "notes": "The analysis is based on a very limited window of active time (approximately 10 minutes across two days). However, within this short snapshot, the recorded activity shows severe signs of high stress. The combination of extremely high backspace rates, excessive app switching, and highly unproductive mouse movement patterns points to significant difficulty concentrating, indecision, frustration, and fragmented attention. The sharp increase in these unfocused behaviors from Day 1 to Day 2, coupled with decreasing active time, further exacerbates concerns, indicating a high stress level or potential early signs of burnout."}}
{"ts": 1763176677.5527549, "window_days": 7, "features": {"window_days": 7, "totals": {"total_time_sec": 646.1065759658813, "typing_words": 25, "backspaces": 21, "keys_pressed": 217, "mouse_distance": 125844.18220636892, "app_switches": 0}, "by_app_top": [{"exe": "chrome.exe", "time_sec": 441.801748752594}, {"exe": "pycharm64.exe", "time_sec": 158.5014045238495}, {"exe": "notepad.exe", "time_sec": 22.89598035812378}, {"exe": "olk.exe", "time_sec": 9.16192626953125}, {"exe": "explorer.exe", "time_sec": 5.622342348098755}, {"exe": "searchhost.exe", "time_sec": 5.5784971714019775}, {"exe": "windsurf.exe", "time_sec": 1.5269098281860352}, {"exe": "bdagent.exe", "time_sec": 0.5138864517211914}, {"exe": "", "time_sec": 0.5038802623748779}], "per_day": [{"date": "2025-11-14", "time": 440.7034206390381, "words": 13, "backspaces": 7, "keys": 83, "mouse": 15084.458634815128, "switches": 8, "wpm": 1.7698977667769584}, {"date": "2025-11-15", "time": 205.40315532684326, "words": 12, "backspaces": 14, "keys": 134, "mouse": 110759.72357155378, "switches": 65, "wpm": 3.505301556124178}]}, "stress": {"level": "high", "score": 88, "confidence": 0.5, "signals": ["Extremely High Backspace Rate: On Day 2 (2025-11-15), backspaces (14) exceeded words typed (12), indicating significant rework, hesitation, or frustration. Day 1 also showed a high rate (7 backspaces for 13 words).", "Extreme App Switching: On Day 2 (2025-11-15), 65 app switches in approximately 3.4 minutes is an extremely high rate (~19 switches/minute), suggesting severe distraction, context switching issues, or an inability to focus on a single task.", "High Mouse Distance with Low Output: Particularly on Day 2, an extremely high mouse distance (110,759 units) for very few words typed (12) and short active time (3.4 minutes) suggests aimless navigation, searching, or difficulty concentrating on productive tasks.", "Day-to-Day Volatility: Significant fluctuations in active time, app switches, and mouse distance between the two captured days point to inconsistent engagement or highly varied, potentially erratic, work patterns."], "notes": "While the total active time recorded across the two-day period is exceptionally low (~10.77 minutes), the activity patterns observed during these brief periods display pronounced indicators of high stress. The extreme backspace rate, frantic app switching, and excessive mouse movement relative to typing output strongly suggest frustration, lack of focus, and inefficiency when engaging with work. However, the extremely limited data volume (only two days out of a seven-day window, with minimal total engagement time) means this analysis reflects the stress levels *during observed activity* rather than providing a confident assessment of the employee's sustained stress over the full period. More comprehensive data over a longer duration is needed for a robust overall assessment."}}
{"ts": 1763176904.3415203, "window_days": 7, "features": {"window_days": 7, "totals": {"total_time_sec": 646.1065759658813, "typing_words": 25, "backspaces": 21, "keys_pressed": 217, "mouse_distance": 125844.18220636892, "app_switches": 0}, "by_app_top": [{"exe": "chrome.exe", "time_sec": 441.801748752594}, {"exe": "pycharm64.exe", "time_sec": 158.5014045238495}, {"exe": "notepad.exe", "time_sec": 22.89598035812378}, {"exe": "olk.exe", "time_sec": 9.16192626953125}, {"exe": "explorer.exe", "time_sec": 5.622342348098755}, {"exe": "searchhost.exe", "time_sec": 5.5784971714019775}, {"exe": "windsurf.exe", "time_sec": 1.5269098281860352}, {"exe": "bdagent.exe", "time_sec": 0.5138864517211914}, {"exe": "", "time_sec": 0.5038802623748779}], "per_day": [{"date": "2025-11-14", "time": 440.7034206390381, "words": 13, "backspaces": 7, "keys": 83, "mouse": 15084.458634815128, "switches": 8, "wpm": 1.7698977667769584}, {"date": "2025-11-15", "time": 205.40315532684326, "words": 12, "backspaces": 14, "keys": 134, "mouse": 110759.72357155378, "switches": 65, "wpm": 3.505301556124178}]}, "stress": {"level": "high", "score": 90, "confidence": 0.75, "signals": ["Exceptionally high backspace-to-word ratio (especially on 2025-11-15, where backspaces exceeded words).", "Extreme app switching rate for the very short duration of activity (e.g., 65 switches in ~3.4 minutes on 2025-11-15).", "Very high mouse distance with remarkably low typing output, indicating extensive navigation or unproductive activity.", "Significant day-to-day volatility in efficiency and focus, with a sharp increase in unproductive metrics (backspaces, mouse distance, app switches) on 2025-11-15 despite similar word output.", "Overall very low total tracked engagement time over the 7-day window, which could suggest disengagement or avoidance of computer-based tasks."], "notes": "While the total tracked time over the 7-day window is extremely short (~10.7 minutes), the activity patterns observed during these brief active periods, particularly on 2025-11-15, show strong and concerning indicators of high stress. The user displayed an exceptionally high backspace-to-word ratio, suggesting significant indecision, frustration, or difficulty in formulating thoughts. This was coupled with an extreme rate of app switching and a disproportionately high mouse distance relative to the minimal textual output, pointing towards severe context switching, distraction, or being overwhelmed. The rapid deterioration of efficiency and focus from one active day to the next further supports a high-stress assessment. It is important to note that the limited duration of tracked activity means these findings are based on intense short bursts. A broader data set over a more representative period would provide higher confidence, but the current signals are indicative of high stress during engagement."}}
{"ts": 1763176960.99944, "window_days": 7, "features": {"window_days": 7, "totals": {"total_time_sec": 671.136666059494, "typing_words": 28, "backspaces": 21, "keys_pressed": 225, "mouse_distance": 133435.4186244265, "app_switches": 0}, "by_app_top": [{"exe": "chrome.exe", "time_sec": 452.0631651878357}, {"exe": "pycharm64.exe", "time_sec": 168.68175292015076}, {"exe": "notepad.exe", "time_sec": 22.89598035812378}, {"exe": "olk.exe", "time_sec": 9.16192626953125}, {"exe": "explorer.exe", "time_sec": 6.136124134063721}, {"exe": "searchhost.exe", "time_sec": 5.5784971714019775}, {"exe": "msedge.exe", "time_sec": 4.074543476104736}, {"exe": "windsurf.exe", "time_sec": 1.5269098281860352}, {"exe": "bdagent.exe", "time_sec": 0.5138864517211914}, {"exe": "", "time_sec": 0.5038802623748779}], "per_day": [{"date": "2025-11-14", "time": 440.7034206390381, "words": 13, "backspaces": 7, "keys": 83, "mouse": 15084.458634815128, "switches": 8, "wpm": 1.7698977667769584}, {"date": "2025-11-15", "time": 230.43324542045593, "words": 15, "backspaces": 14, "keys": 142, "mouse": 118350.95998961141, "switches": 73, "wpm": 3.9056864314775024}]}, "stress": {"level": "high", "score": 88, "confidence": 0.7, "signals": ["Extremely high backspace-to-word ratio (0.93 on Day 2, 0.75 overall), indicating significant re-work, frustration, or indecision.", "Extreme app switching (73 switches in ~3.8 minutes on Day 2, ~19 switches per minute), suggesting high distraction, context shifting, or frantic activity.", "Very high mouse distance with low words (118,350 units for 15 words on Day 2), pointing to aimless navigation, extensive searching, or struggling to find information/solution without productive output.", "Significant day-to-day volatility in activity patterns, with Day 2 showing a stark increase in unproductive behaviors despite shorter active time.", "The total activity time is extremely low (~11 minutes over a reported 7-day window), suggesting very limited engagement or fragmented work sessions, which could be a consequence of or contributor to stress."], "notes": "The analysis is based on a very limited window of activity (approximately 11 minutes across 2 recorded days within a 7-day window). Despite the short duration, the intensity of several key stress indicators, particularly on Day 2, is exceptionally high. The observed patterns of high backspace rate, extreme app switching, and disproportionate mouse movement relative to typing output strongly suggest a high level of stress, frustration, or distraction during the active periods. The discrepancy in 'app_switches' between 'totals' (0) and 'per_day' (summing to 81) indicates a potential data quality issue, but the per-day breakdown provides critical granular insights used for this assessment."}}
