{"ts": 1763171134.9254653, "window_days": 7, "features": {"window_days": 7, "totals": {"total_time_sec": 581.012490272522, "typing_words": 23, "backspaces": 13, "keys_pressed": 170, "mouse_distance": 94848.19849491118, "app_switches": 0}, "by_app_top": [{"exe": "chrome.exe", "time_sec": 429.05062317848206}, {"exe": "pycharm64.exe", "time_sec": 116.39935994148254}, {"exe": "notepad.exe", "time_sec": 16.2195246219635}, {"exe": "olk.exe", "time_sec": 9.16192626953125}, {"exe": "explorer.exe", "time_sec": 5.106692552566528}, {"exe": "searchhost.exe", "time_sec": 4.056596994400024}, {"exe": "bdagent.exe", "time_sec": 0.5138864517211914}, {"exe": "", "time_sec": 0.5038802623748779}], "per_day": [{"date": "2025-11-14", "time": 440.7034206390381, "words": 13, "backspaces": 7, "keys": 83, "mouse": 15084.458634815128, "switches": 8, "wpm": 1.7698977667769584}, {"date": "2025-11-15", "time": 140.3090696334839, "words": 10, "backspaces": 6, "keys": 87, "mouse": 79763.73986009604, "switches": 46, "wpm": 4.276273811574143}]}, "stress": {"level": "high", "score": 90, "confidence": 0.8, "signals": ["Sustained high backspace-to-word ratio (average 36% across recorded time), indicating uncertainty or difficulty in articulating thoughts.", "Extreme app switching observed on one of the active days (46 switches in 2.3 minutes), suggesting high distraction, lack of focus, or task context switching fatigue.", "Very high mouse distance relative to words typed on one of the active days (79,763 units for only 10 words), indicative of aimless navigation, searching, or difficulty engaging with productive tasks.", "Significant day-to-day volatility in app switching and mouse activity, with a sharp increase in unfocused activity on the second recorded day.", "Overall extremely low total recorded engagement time (less than 10 minutes over a 7-day window, with only 2 days of activity), which could imply severe disengagement, burnout, or unlogged work."], "notes": "The data provided covers an extremely short total engagement time across the 7-day window. While the overall duration is minimal, the patterns observed during the active periods are highly indicative of elevated stress. Specifically, the metrics for '2025-11-15' show severe signs of struggle, including intense distraction and minimal productive output within the recorded 2.3 minutes of activity. The low total activity for the week could itself be a symptom of high stress leading to disengagement, or it suggests significant periods of absence or unlogged work."}}
{"ts": 1763171163.1572196, "window_days": 7, "features": {"window_days": 7, "totals": {"total_time_sec": 581.012490272522, "typing_words": 23, "backspaces": 13, "keys_pressed": 170, "mouse_distance": 94848.19849491118, "app_switches": 0}, "by_app_top": [{"exe": "chrome.exe", "time_sec": 429.05062317848206}, {"exe": "pycharm64.exe", "time_sec": 116.39935994148254}, {"exe": "notepad.exe", "time_sec": 16.2195246219635}, {"exe": "olk.exe", "time_sec": 9.16192626953125}, {"exe": "explorer.exe", "time_sec": 5.106692552566528}, {"exe": "searchhost.exe", "time_sec": 4.056596994400024}, {"exe": "bdagent.exe", "time_sec": 0.5138864517211914}, {"exe": "", "time_sec": 0.5038802623748779}], "per_day": [{"date": "2025-11-14", "time": 440.7034206390381, "words": 13, "backspaces": 7, "keys": 83, "mouse": 15084.458634815128, "switches": 8, "wpm": 1.7698977667769584}, {"date": "2025-11-15", "time": 140.3090696334839, "words": 10, "backspaces": 6, "keys": 87, "mouse": 79763.73986009604, "switches": 46, "wpm": 4.276273811574143}]}, "stress": {"level": "high", "score": 85, "confidence": 0.6, "signals": ["Consistently high backspace-to-word ratio (average 0.56), indicating indecision, frustration, or difficulty articulating thoughts.", "Extremely high app switching on Day 2 (46 switches in ~2.3 minutes, approximately 20 switches/minute), a strong indicator of severe distraction, context-switching overload, or inability to focus.", "Disproportionately high mouse distance relative to words typed, particularly on Day 2 (79763 mouse distance for 10 words), suggesting aimless navigation, information seeking without productive output, or difficulty engaging in deep work.", "Significant day-to-day volatility in engagement metrics (app switches increasing dramatically, mouse distance increasing dramatically, total time decreasing) between the two observed days."], "notes": "The analysis is based on an extremely limited window of observed activity (less than 10 minutes across two reported days). While the patterns *within* this brief period strongly suggest an elevated stress level characterized by high distraction, indecision, and potential overwhelm, these findings may not be representative of the employee's overall well-being throughout an entire work week. Further data over longer, more typical work periods would be required for a more robust and generalized assessment. The discrepancy between 'totals.app_switches': 0 and 'per_day' app switches suggests either incomplete 'totals' data or a reporting error, with 'per_day' data prioritized for signal analysis due to its granularity."}}
{"ts": 1763173557.2504427, "window_days": 7, "features": {"window_days": 7, "totals": {"total_time_sec": 606.0416259765625, "typing_words": 23, "backspaces": 20, "keys_pressed": 190, "mouse_distance": 109311.89257587297, "app_switches": 0}, "by_app_top": [{"exe": "chrome.exe", "time_sec": 434.6543126106262}, {"exe": "pycharm64.exe", "time_sec": 134.29789638519287}, {"exe": "notepad.exe", "time_sec": 16.2195246219635}, {"exe": "olk.exe", "time_sec": 9.16192626953125}, {"exe": "explorer.exe", "time_sec": 5.106692552566528}, {"exe": "searchhost.exe", "time_sec": 4.056596994400024}, {"exe": "windsurf.exe", "time_sec": 1.5269098281860352}, {"exe": "bdagent.exe", "time_sec": 0.5138864517211914}, {"exe": "", "time_sec": 0.5038802623748779}], "per_day": [{"date": "2025-11-14", "time": 440.7034206390381, "words": 13, "backspaces": 7, "keys": 83, "mouse": 15084.458634815128, "switches": 8, "wpm": 1.7698977667769584}, {"date": "2025-11-15", "time": 165.3382053375244, "words": 10, "backspaces": 13, "keys": 107, "mouse": 94227.43394105784, "switches": 52, "wpm": 3.628925321737641}]}, "stress": {"level": "high", "score": 92, "confidence": 0.9, "signals": ["Extremely high backspace rate: The overall backspace-to-typed-words ratio is 20 backspaces for 23 words (approximately 46.5% of input deleted), reaching 56.5% on Day 2. This indicates significant struggle, indecision, or frustration during typing.", "Excessive app switching: On Day 2, 52 app switches were recorded in just 2.7 minutes (approximately 19.3 switches per minute). This is an extremely high rate, strongly suggesting severe context switching, distraction, or frantic task-hopping.", "High mouse distance with low words typed: The employee averaged approximately 4752.7 mouse units per word typed across the two days, peaking at 9422.7 units per word on Day 2. This indicates extensive unfocused navigation, browsing, or searching with very low productive textual output.", "Significant day-to-day volatility in unfocused metrics: App switches increased over 6-fold (from 8 to 52) and mouse distance increased over 6-fold (from ~15k to ~94k) from Day 1 to Day 2, while total active time significantly decreased. This suggests worsening focus and increasing fragmentation.", "Very short total active time: Only approximately 10 minutes of recorded active time across two days. If this represents the total work activity, it could indicate severe disengagement, an inability to focus for sustained periods (potentially stress-induced), or feeling overwhelmed."], "notes": "The analysis is based on a very limited window of active time (approximately 10 minutes across two days). However, within this short snapshot, the recorded activity shows severe signs of high stress. The combination of extremely high backspace rates, excessive app switching, and highly unproductive mouse movement patterns points to significant difficulty concentrating, indecision, frustration, and fragmented attention. The sharp increase in these unfocused behaviors from Day 1 to Day 2, coupled with decreasing active time, further exacerbates concerns, indicating a high stress level or potential early signs of burnout."}}
